app/controllers/produtos_controller.rb

  def index
    @produtos_por_nome = Produto.order :nome
    @produtos_por_preco = Produto.order(:preco).limit 3
---
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 3]]

  def create
    valores = produto_params
    @produto = Produto.new valores

    if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "departamento_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
      #set_produto
      @produto.destroy
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 49]]

  def update
    #set_produto
    valores = produto_params
    if @produto.update valores #observa cada valor permitido em valores e atualiza
---
UPDATE "produtos" SET "nome" = ?, "descricao" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Marvel Avengers"], ["descricao", "Camiseta com logo dos vingadores."], ["updated_at", "2018-04-24 04:06:14.581276"], ["id", 47]]

  def set_produto #busca produto por id
    id = params[:id]
    @produto = Produto.find(id)
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]